[
  {
    "date": "October 19",
    "title": "St. Paul of the Cross, C.P.",
    "type": "Founder's Feast (Solemnity)",
    "charism_focus": "The core spirit: to preach the love of God revealed in the Passion of Jesus Christ.",
    "relevance_to_moha": "The Father and guide. His writings shape the spiritual life of the seminarians."
  },
  {
    "date": "September 15",
    "title": "Our Lady of Sorrows",
    "type": "Solemnity",
    "charism_focus": "Central devotion of the Passionists. Meditation on Mary's role as co-sufferer at the foot of the Cross.",
    "relevance_to_moha": "A model of fidelity and discernment for all those in formation."
  },
  {
    "date": "February 27",
    "title": "St. Gabriel of Our Lady of Sorrows, C.P.",
    "type": "Feast",
    "charism_focus": "Patron of youth and students. Known for his rapid ascent to holiness through devotion to Mary.",
    "relevance_to_moha": "An inspiration for the seminarians in their own intellectual and spiritual formation journey."
  },
  {
    "date": "August 26",
    "title": "Blessed Dominic Barberi, C.P.",
    "type": "Feast",
    "charism_focus": "The great missionary and apostle of ecumenism. Received St. John Henry Newman into the Church.",
    "relevance_to_moha": "Highlights the missionary zeal essential for the Passionists in Kenya, Tanzania, and Mozambique."
  },
  {
    "date": "May 16",
    "title": "St. Gemma Galgani",
    "type": "Feast (Lay Passionist)",
    "charism_focus": "A mystic who lived the Passionist charism as a layperson. Patroness of the Vice-Province.",
    "relevance_to_moha": "A reminder that the Passionist charism is lived by all members of the wider Passionist Family."
  },
  {
    "date": "Varies (Fri. before Ash Wed.)",
    "title": "Solemn Commemoration of the Passion",
    "type": "Congregational Feast",
    "charism_focus": "A special day to honor the foundational event of our Redemption.",
    "relevance_to_moha": "The liturgical peak of the Passionist year, underscoring the purpose of their life and study."
  }
]